Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementSetGroupAttributes.HookedEndSymbolType Property
 Gets or sets how the hooked ends of reinforcing bars should look like.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementBase.HookedEndSymbolTypes HookedEndSymbolType { get; set; }
Public Property HookedEndSymbolType As ReinforcementBase.HookedEndSymbolTypes
	Get
	Set
Property Value
Type: ReinforcementBase.HookedEndSymbolTypes
See Also
Reference
ReinforcementBase.ReinforcementSetGroupAttributes Class
Tekla.Structures.Drawing Namespace